In [1]:
import pandas as pd

In [2]:
employee_data = {
    "Employee ID": [1, 2, 3, 4, 5],
    "Name": ["Alice", "Bob", "Carol", "Dave", "Eve"],
    "Job Title": ["Software Engineer", "Data Scientist", "Marketing Manager", "Sales Manager", "Product Manager"],
    "Department": ["Engineering", "Data Science", "Marketing", "Sales", "Product"],
    "Salary": [100000, 120000, 140000, 160000, 180000],
}

In [3]:
employee_df = pd.DataFrame(employee_data)

In [4]:
employee_df

   Employee ID   Name          Job Title    Department  Salary
0            1  Alice  Software Engineer   Engineering  100000
1            2    Bob     Data Scientist  Data Science  120000
2            3  Carol  Marketing Manager     Marketing  140000
3            4   Dave      Sales Manager         Sales  160000
4            5    Eve    Product Manager       Product  180000

In [5]:
employee_df.isnull().sum()

Employee ID    0
Name           0
Job Title      0
Department     0
Salary         0
dtype: int64

In [6]:
employee_df.describe()

       Employee ID         Salary
count     5.000000       5.000000
mean      3.000000  140000.000000
std       1.581139   31622.776602
min       1.000000  100000.000000
25%       2.000000  120000.000000
50%       3.000000  140000.000000
75%       4.000000  160000.000000
max       5.000000  180000.000000

In [7]:
employee_df.dtypes

Employee ID     int64
Name           object
Job Title      object
Department     object
Salary          int64
dtype: object

In [8]:
employee_df.columns = employee_df.columns.str.lower().str.replace(' ', '_')

In [9]:
employee_df

   employee_id   name          job_title    department  salary
0            1  Alice  Software Engineer   Engineering  100000
1            2    Bob     Data Scientist  Data Science  120000
2            3  Carol  Marketing Manager     Marketing  140000
3            4   Dave      Sales Manager         Sales  160000
4            5    Eve    Product Manager       Product  180000

In [10]:
strings = list(employee_df.dtypes[employee_df.dtypes == 'object'].index)

In [11]:
for col in strings:
    employee_df[col] = employee_df[col].str.lower().str.replace(' ', '_')

In [12]:
employee_df

   employee_id   name          job_title    department  salary
0            1  alice  software_engineer   engineering  100000
1            2    bob     data_scientist  data_science  120000
2            3  carol  marketing_manager     marketing  140000
3            4   dave      sales_manager         sales  160000
4            5    eve    product_manager       product  180000

In [13]:
employee_df.salary

0    100000
1    120000
2    140000
3    160000
4    180000
Name: salary, dtype: int64

In [14]:
employee_df['new_salary'] = employee_df['salary'] * 2

In [15]:
employee_df

   employee_id   name          job_title    department  salary  new_salary
0            1  alice  software_engineer   engineering  100000      200000
1            2    bob     data_scientist  data_science  120000      240000
2            3  carol  marketing_manager     marketing  140000      280000
3            4   dave      sales_manager         sales  160000      320000
4            5    eve    product_manager       product  180000      360000

In [16]:
employee_df.loc[employee_df['salary'] > 150000]

   employee_id  name        job_title department  salary  new_salary
3            4  dave    sales_manager      sales  160000      320000
4            5   eve  product_manager    product  180000      360000

In [17]:
emp_mean_salary = employee_df['salary'].mean()

In [18]:
employee_df.loc[employee_df['salary'] > emp_mean_salary, 'gt_mean_salary'] = 1

In [19]:
employee_df

,employee_id,name,job_title,department,salary,new_salary,gt_mean_salary
0,1,alice,software_engineer,engineering,100000,200000,NaN
1,2,bob,data_scientist,data_science,120000,240000,NaN
2,3,carol,marketing_manager,marketing,140000,280000,NaN
3,4,dave,sales_manager,sales,160000,320000,1.0
4,5,eve,product_manager,product,180000,360000,1.0

In [20]:
import numpy as np

In [21]:
employee_df['gt_mean_salary'] = np.where(employee_df['salary'] > emp_mean_salary, 1, 0)

In [22]:
employee_df

,employee_id,name,job_title,department,salary,new_salary,gt_mean_salary
0,1,alice,software_engineer,engineering,100000,200000,0
1,2,bob,data_scientist,data_science,120000,240000,0
2,3,carol,marketing_manager,marketing,140000,280000,0
3,4,dave,sales_manager,sales,160000,320000,1
4,5,eve,product_manager,product,180000,360000,1

In [23]:
employee_df.loc[employee_df['department'] == 'sales']

,employee_id,name,job_title,department,salary,new_salary,gt_mean_salary
3,4,dave,sales_manager,sales,160000,320000,1

In [26]:
def job_filter(df, job_title):
    return df.loc[df["job_title"] == job_title]

In [27]:
job_filter(employee_df, "data_scientist")

,employee_id,name,job_title,department,salary,new_salary,gt_mean_salary
1,2,bob,data_scientist,data_science,120000,240000,0

In [30]:
import filters

In [31]:
filters.job_filter(employee_df, "data_scientist")

,employee_id,name,job_title,department,salary,new_salary,gt_mean_salary
1,2,bob,data_scientist,data_science,120000,240000,0